In [1]:
import numpy as np
import pandas as pd
import datetime
import calendar
from dateutil import relativedelta
import xlrd
import pprint

In [2]:
df = pd.read_excel('excel file/test.xlsx', index_col=0)

In [3]:
df

         end      name
start
44438  44451  山口、木村、澤井
44452  44465     持田、村越
44466  44479     小林、伊藤
44480  44493    佐々木、中山

In [21]:
df_sheet2 = pd.read_excel('excel file/test.xlsx', sheet_name='Sheet2')

In [22]:
df_sheet2

   start    end      name
0  44424  44436  梶野、持田、村越
1  44437  44450  平野、伊藤、小林
2  44451  44464  大谷、小原、中山
3  44465  44478   旭、澤井、木村
4  44479  44493  遠藤、山口、市川
5  44494  44507   高橋、和田、森

In [23]:
df_sheet2.columns

Index(['start', 'end', 'name'], dtype='object')

In [6]:
dt_now = datetime.datetime.now()

In [7]:
calendar.prmonth(dt_now.year, dt_now.month)

   September 2021
Mo Tu We Th Fr Sa Su
       1  2  3  4  5
 6  7  8  9 10 11 12
13 14 15 16 17 18 19
20 21 22 23 24 25 26
27 28 29 30

In [27]:
df_sheet2['start']

0    44424
1    44437
2    44451
3    44465
4    44479
5    44494
Name: start, dtype: int64

In [31]:
test1 = pd.to_timedelta(df_sheet2['start'][0],unit='D')+pd.to_datetime("1899/12/30")

In [32]:
test1.month

8

In [33]:
test1.day

16